function biography(){
    document.getElementById("article").innerHTML="<img class=\"img-left\" src=\"img/fedusenko.jpg\" alt=\"Фото Федусенко Олени Володимирівни\">\n" +
        "        <h1>Федусенко Олена Володимирівна</h1>\n" +
        "        <p>Федусенко Олена Володимирівна — кандидат технічних наук, доцент, доцент кафедри інтелектуальних технологій.\n" +
        "            Отримала вищу освіту в Київському національному університеті будівництва та архітектури за спеціальністю\n" +
        "            «Інженер системотехнік».\n" +
        "        </p>\n" +
        "        <p>\n" +
        "            У період з 2001 по 2017 рік, працювала у Київському національному університеті будівництва та архітектури як\n" +
        "            асистент, доцент. З 2017 року — у Київському національний університет імені Тараса Шевченка як доцент.\n" +
        "        </p>\n" +
        "        <p>\n" +
        "            Олена Володимирівна має понад 70 наукових праць, 2 навчальних посібника, 24 статей у фахових виданнях\n" +
        "            України, 26 тез доповідей на конференціях. Її\n" +
        "            <a href=\"https://uk.wikipedia.org/wiki/H-індекс?useskin=vector\" target='_blank'> індекс Гірша</a> у Google Scholar – 4.\n" +
        "        </p>\n" +
        "        <p>\n" +
        "            Академічні профілі Олени Федусенко:\n" +
        "        </p>\n" +
        "            <ul>\n" +
        "                <li><a href=\"https://scholar.google.com/citations?user=vAZYvP4AAAAJ&amp;hl=uk\" target=\"_blank\">Google\n" +
        "                    Scholar</a></li>\n" +
        "                <li><a href=\"https://www.scopus.com/authid/detail.uri?authorId=8422284800\" target=\"_blank\">Scopus</a></li>\n" +
        "                <li><a href=\"https://www.webofscience.com/wos/author/record/ABH-3002-2021\" target=\"_blank\">Web of\n" +
        "                    Science</a></li>\n" +
        "                <li><a href=\"https://www.researchgate.net/profile/Olena-Fedusenko/research\" target=\"_blank\">Researchgate</a>\n" +
        "                </li>\n" +
        "                <li><a href=\"https://orcid.org/0000-0002-5782-5922\" target=\"_blank\">Orcid</a></li>\n" +
        "            </ul>";
}

function subj_info() {
    document.getElementById('article').innerHTML='<h1>Проектування та розробка веб-застосунків — дуже класна дисципліна, мені подобається.</h1>' +
        '<h2>Мета</h2>' +
        '<p>Мета дисципліни – забезпечити формування у студентів теоретичних знань та' +
        'практичних навичок проектування та розробки власних Web - застосувань з використанням' +
        'сучасних Web- технологій.</p>' +
        '<h2>Анотація</h2>' +
        '<p>В програмі дисципліни основна увага приділяється основам Web-програмування, а саме' +
        'мові розмітки HTML, каскадним таблицям стилів CSS, та питанням розробки сучасного\n' +
        'Web – дизайну. Розглядається мова розробки сценаріїв на стороні клієнту JavaScript.\n' +
        'Проблеми використання систем керування контентом (CMS), оскільки дисципліна\n' +
        'орієнтована на розробку власних Web – застосунків, розглядаються тільки в контексті\n' +
        'інших питань, натомість до розгляду включено вивчення одного з найпопулярніших\n' +
        'фреймворків JavaScript Angular.</p>' +
        '<h2>Навчальні цілі</h2>' +
        '<p>Викладання дисципліни спрямоване на формування у студентів компетенції:\n' +
        'Здатність реалізувати багаторівневу обчислювальну модель на основі архітектури клієнт-\n' +
        'сервер, включаючи бази даних, знань і сховища даних, виконувати розподілену обробку\n' +
        'великих наборів даних на кластерах стандартних серверів для забезпечення обчислювальних\n' +
        'потреб користувачів, у тому числі на хмарних сервісах.</p>' +
        '<h2>Формування оцінки</h2>' +
        '<ul><li>Лабораторні роботи РН 2.1-2.6– 50/30 балів – 50%\n</li>' +
        '<li>Самостійні роботи: РН 2.1 - 2.6, РН 3.1-3.2 – 20/12 балів – 20%\n</li>' +
        '<li>Контрольна робота 1 : РН 1.1.-1.3 - 15 балів/6 балів - 15%\n</li>' +
        '<li>Контрольна робота 2: РН 1.4 - 1.6 - 15 балів/6 балів -15%</li></ul>' +
        '<h2>Організація оцінювання</h2>' +
        '<p>Упродовж семестру, після завершення відповідних тем, проводяться дві письмові\n' +
        'контрольні роботи у вигляді практичного завдання.\n' +
        'Для студентів які упродовж семестру не досягли мінімального рубіжного рівня оцінки\n' +
        '(60% від максимально можливої кількості балів) проводиться заключна семестрова\n' +
        'контрольна робота, максимальна оцінка за яку не може перевищувати 40% підсумкової\n' +
        'оцінки.\n' +
        'Умовою отримання позитивної результуючої оцінки за дисципліну є досягнення не\n' +
        '\n' +
        'менш як 60% від максимально можливої кількості балів, при цьому за оцінка за результатами\n' +
        'навчання 2.1 – 2.6 не може бути меншою ніж 50% від максимального рівня.\n' +
        '<h2>Підсумкове оцінювання у формі заліку</h2>' +
        '<p>Залік виставляється студенту за\n' +
        'результатами роботи у продовж семестру. При отримані результуючої підсумкової кількості\n' +
        'балів від 60 та вище студенту ставиться <b>зараховано</b>. При бажанні студента, за наявності\n' +
        'залікових балів, покращити свій результат, він має право здавати залік на який виноситься 20\n' +
        'балів, але сумарна кількість балів при цьому не може бути більшою за 100 балів.\n</p>' +
        '<p>Студенти які набрали сумарно менше, аніж критично розрахунковий мінімум 40 балів\n' +
        'до складання заліку не допускаються, рекомендований мінімум 48 балів.</p>';
    document.getElementById('article').setAttribute()
}

function schedule() {
    document.getElementById('article').innerHTML='На жаль, розклад занять викладача недоступний :(';
}

function sci_articles(){
    document.getElementById('article').innerHTML='<h1>Монографії, підручники, посібники</h1>' +
        '<ul>' +
        '<li>Навчальний посібник для студентів спеціальності 122 «Комп’ютерні науки» з дисципліни «Проєктування та розробка веб-застосунків» Частина 1. HTML5 та CSS3 Укл./ Федусенко О.В.,Доманецька І.М., Іларіонов О.Є., Красовська Г.В. [Електронний ресурс]: Навчальний посібник/ Федусенко О.В. – К.: КНУ імені Тараса Шевченка, 2023. – 139 с. (<a href="https://www.researchgate.net/publication/371509270_Navcalnij_posibnik_z_disciplini_Proektuvanna_ta_rozrobka_veb-zastosunkiv_Castina_1_HTML5_ta_CSS3" target="_blank">переглянути</a>)<br>\n</li>' +
        '<li>Навчальний посібник з дисципліни «Теорія алгоритмів. Частина1. Формальні моделі алгоритмів» для студентів освітніх програм «Комп’ютерні науки», «Аналітика даних» спеціальності 122 «Комп’ютерні науки» освітнього ступеня «Бакалавр» Укл. / І.М.Доманецька І.М., Г.В.Красовська , О.Є.Іларіонов, О.В. Федусенко [Електронний ресурс]: Навчальний посібник-практикум. / Доманецька І.М. – К.: КНУ імені Тараса Шевченка, 2020. – 138 с.<br>\n</li>' +
        '<li>О.В. Федусенко, І.М. Доманецька, Г.В. Красовська Проектування систем електронного документообігу. Навчальний посібник, К.:КНУБА,2016 – 88с.<br>\n</li>' +
        '<li>Г.В. Красовська, І.М. Доманецька, О.В. Федусенко Застосування об’єктно-орієнтованого підходу на прикладі задач будівельної галузі Навчальний посібник, К.:КНУБА,2016 – 116с.</p></li>' +
        '</ul>' +
        '<h1>Публікації, що індексуються у Scopus або Web of Science</h1>\n' +
        '<ul>' +
        '<li>О.В. Федусенко, І.М. Доманецька, Д.Ю. Семенюк Розроблення комп’ютерної гри з голосовим інтерфейсом для вивчення англійської мови дітьми дошкільного віку / Інформаційні технології і засоби навчання, 2021, Том 85 №5, С. 95-117 (<a href="https://journal.iitta.gov.ua/index.php/itlt/article/view/4306" target="_blank">переглянути</a>)<br>\n </li>' +
        '<li>Tetyana Honcharenko, Yurii Andrashko, Olena Fedusenko, Iryna Domanetska, Nataliia Olkhova. The Method of Generalizing Spatial Information into A Single Multidimensional Data Model. International Journal of Recent Technology and Engineering. 2019. Vol. 8, Issue 4. P. 8426–8432. (<a href="https://doi.org/10.35940/ijrte.D9419.118419" target="_blank">переглянути</a>)<br>\n </li>' +
        '<li>Khrolenko, Y., Domanetska, I., Ilarionov, O., Krasovska, H., Fedusenko, O. Classifier for the Diagnostic of Obstructive Sleep Apnea Syndrome(Conference Paper) Information Technology and Implementation (IT&amp;I-2023), November 30 – December 02, 2022, Kyiv, Ukraine, CEUR Workshop Proceedings, 2023, 3384, pp. 24–41 (<a href="https://www.scopus.com/record/display.uri?eid=2-s2.0-85159564692&amp;origin=inward&amp;txGid=ce227425745c904b2b9c1e868d626475" target="_blank">переглянути</a>)</p></li>' +
        '</ul>';
}